Proyecto/proyecto1/proyecto1/app/controllers/breads_controller.rb

SELECT "breads".* FROM "breads"
---
  def comprar
    @breads = Bread.all