Proyecto/proyecto1/proyecto1/app/controllers/deditos_controller.rb

SELECT "deditos".* FROM "deditos"
---
  def comprar
    @deditos = Dedito.all