Proyecto/proyecto1/proyecto1/app/controllers/donas_controller.rb

SELECT "donas".* FROM "donas"
---
  def comprar
    @donas = Dona.all