admin2/app/controllers/breads_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find(params[:product_id])

SELECT "breads".* FROM "breads" WHERE "breads"."product_id" = ?  [["product_id", 2]]
---
  def set_bread
    @bread = @product.breads.find(params[:id])