admin2/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["description", ""], ["created_at", "2023-06-28 06:34:59.477641"], ["updated_at", "2023-06-28 06:34:59.477641"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save